lst = [1, 2, 3, 4, 5, 6] #=> [[1, 2, 3], [4, 5, 6]]
#lst = [1, 2, 3] #=> [[1, 2], [3]]
#lst = [1, 2, 3, 4, 5] #=> [[1, 2, 3], [4, 5]]
#lst = [1] #=> [[1], []]
#lst = [] #=> [[], []]

len_list = len(lst);
new_lst = []; #Початкове значення результату - порожній список
#Перевіряємо чи початковий список порожній
if len_list == 0:
    #Двічі додаємо початковий список до результату
    new_lst.append(lst);
    new_lst.append(lst);
    print(new_lst);
else:
    #Перевіряємо парність/непарність кількості елементів початкового списку
    if len_list%2 == 0:
        #Робимо зрізи початкового списку рівно навпіл
        lst_slice_1 = lst[:int(len_list/2)];
        lst_slice_2 = lst[int(len_list/2):];
    else:
        #Робимо зрізи початкового списку так, щоб в першому зрізі елементів було на 1 більше
        lst_slice_1 = lst[:int(len_list//2 + 1)];
        lst_slice_2 = lst[int(len_list//2 + 1):];
    #Додаємо зрізи до результату і виводимо на екран
    new_lst.append(lst_slice_1);
    new_lst.append(lst_slice_2);
    print(new_lst);