lst = [0, 1, 0, 12, 3] #-> [1, 12, 3, 0, 0]
#lst = [0] #-> [0]
#lst = [1, 0, 13, 0, 0, 0, 5] #-> [1, 13, 5, 0, 0, 0, 0]
#lst = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] #-> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]

#вважаємо, що список - непорожній
n = lst.count(0); #рахуємо кількість нулів в списку
lst = [x for x in lst if x!=0]; #видаляємо нулі зі списку,тим самим зберігаючи послідовність інших його елементів
#послідовно додаємо до списку нулі справа - їхня кількість обчислена раніше
i = 1;
while i <= n:
    lst.append(0);
    i = i + 1;
print(lst);