#999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
#1000 -> 0
#423 -> 8
#33 -> 9
#25 -> 0
#1 -> 1
#5789 -> 0
#3214 -> 8

import math
number = int(input("Enter a number: "))
result = 10 #задаємо змінній результату будь-яке значення більше за 9, щоб увійти в цикл
while result > 9:
    tpl_number = tuple(int(digit) for digit in str(number)) #розбиваємо число на цифри, які утворюють кортеж
    result = math.prod(tpl_number)                          #перемножаємо елементи кортежу
    #нижче закоментовано код, який відповідає за обчислення добутку елементів кортежу без використання модуля math
    #result = 1
    #for elem in tpl_number:
    #    result *= elem
    number = result
print(result)